workspace/Catalogs/АукКаналыВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукКаналыВзаимодействия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НесколькоЗначенийЭлементовНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементНастройки</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыНастроекКаналовВзаимодействия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Catalogs/АукКаналыВзаимодействия/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолноеОписаниеСвойствКаналаВзаимодействия(пКаналВзаимодействия) Экспорт

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("СвойстваКанала",		ОписаниеОсновныхСвойствКаналаВзаимодействия(пКаналВзаимодействия));
	сткРезультат.Вставить("СвязанныеНастройки",	СписокСвязанныхНастроекКаналаВзаимодействия(пКаналВзаимодействия));
	
	Возврат сткРезультат;
	
КонецФункции

Функция ОписаниеОсновныхСвойствКаналаВзаимодействия(пКаналВзаимодействия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукКаналыВзаимодействия.НесколькоЗначенийЭлементовНастройки КАК НесколькоЗначенийЭлементовНастройки
	|ИЗ
	|	Справочник.АукКаналыВзаимодействия КАК АукКаналыВзаимодействия
	|ГДЕ
	|	АукКаналыВзаимодействия.Ссылка = &КаналВзаимодействия";
	
	Запрос.УстановитьПараметр("КаналВзаимодействия", пКаналВзаимодействия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
		
КонецФункции

Функция СписокСвязанныхНастроекКаналаВзаимодействия(пКаналВзаимодействия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_КаналыВзаимодействияСтруктураНастроек.ЭлементНастройки КАК ЭлементНастройки
	|ИЗ
	|	Справочник.АукКаналыВзаимодействия.СтруктураНастроек КАК Аук_КаналыВзаимодействияСтруктураНастроек
	|ГДЕ
	|	Аук_КаналыВзаимодействияСтруктураНастроек.Ссылка = &КаналВзаимодействия";
	
	Запрос.УстановитьПараметр("КаналВзаимодействия", пКаналВзаимодействия);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭлементНастройки");
	
КонецФункции

Функция ЕстьОбработчикКаналаВзаимодействия(пКаналВзаимодействия) Экспорт

	Если пКаналВзаимодействия = АукОбщийКлиентСервер.КаналВзаимодействия_ПочтовыйНеавтоматический() Тогда	
		Возврат Истина;	
	Иначе	
		Возврат Ложь;	
	КонецЕсли;	
	
КонецФункции

Функция ТехническиеНаименованияЭлементовНастройкиКаналаВзаимодействия(пКаналВзаимодействия) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукЭлементыНастроекКаналовВзаимодействия.ТехническоеНаименование КАК ТехническоеНаименование
	|ИЗ
	|	Справочник.АукКаналыВзаимодействия.СтруктураНастроек КАК Аук_КаналыВзаимодействияСтруктураНастроек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыНастроекКаналовВзаимодействия КАК АукЭлементыНастроекКаналовВзаимодействия
	|		ПО Аук_КаналыВзаимодействияСтруктураНастроек.ЭлементНастройки = АукЭлементыНастроекКаналовВзаимодействия.Ссылка
	|ГДЕ
	|	Аук_КаналыВзаимодействияСтруктураНастроек.Ссылка = &КаналВзаимодействия";
	
	Запрос.УстановитьПараметр("КаналВзаимодействия", пКаналВзаимодействия);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТехническоеНаименование");	
КонецФункции

Функция ОтправитьСообщениеВКанал(пСткДанныеСообщения) Экспорт
	
	Если пСткДанныеСообщения.channel = АукОбщийКлиентСервер.КаналВзаимодействия_ПочтовыйНеавтоматический() Тогда	
		сткПараметрыПисьма = ОтправитьСообщениеВКанал_ПочтовыйНеавтоматический_Параметры();
		
		// 1. Подстановка значений параметров в шаблон
		Если пСткДанныеСообщения.template_parameter_values <> Неопределено Тогда
			ЗаменитьПараметрыВШаблонеНаЗначения(пСткДанныеСообщения.subject, пСткДанныеСообщения.template_parameter_values);	
				
			ЗаменитьПереносыНаТэгиHTML(пСткДанныеСообщения.message);
			
			ЗаменитьПараметрыВШаблонеНаЗначения(пСткДанныеСообщения.message, пСткДанныеСообщения.template_parameter_values);
		КонецЕсли;
		
		сткПараметрыПисьма.Тема		= пСткДанныеСообщения.subject;
		сткПараметрыПисьма.Текст	= пСткДанныеСообщения.message;
				
		Для Каждого ЭлНастройка Из пСткДанныеСообщения.channel_settings Цикл		
			сткПараметрыПисьма.Получатели.Добавить(ЭлНастройка.EMail);		
		КонецЦикла;	
		
		Возврат ОтправитьСообщениеВКанал_ПочтовыйНеавтоматический(сткПараметрыПисьма);	
	Иначе
		
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Для канала не реализован обработчик'"));
		
	КонецЕсли;	
		
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтправитьСообщениеВКанал_ПочтовыйНеавтоматический(пСткСообщение, пАккаунт = Неопределено)
	
	Аккаунт = АукОбщийСервер.АккаунтРассылкиКотировки();
	
	Попытка
		Рассылки.ОтправитьПисьмо(пСткСообщение, Аккаунт);
		
		Возврат ЭдоОбщий._Успех();
	Исключение	
		стрОшибка = ОписаниеОшибки();
		
		Возврат ЭдоОбщий._Ошибка(стрОшибка);	
	КонецПопытки;
	
КонецФункции	

Функция ОтправитьСообщениеВКанал_ПочтовыйНеавтоматический_Параметры()
	
	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Тема",		"");
	сткРезультат.Вставить("Текст",		"");
	сткРезультат.Вставить("Получатели", Новый Массив);
	сткРезультат.Вставить("ТипТекста",	ТипТекстаПочтовогоСообщения.HTML);
	
	Возврат сткРезультат;
	
КонецФункции

Процедура ЗаменитьПереносыНаТэгиHTML(пСтрСообщение)
	масСтроки = СтрРазделить(пСтрСообщение, Символы.ПС);
	
	масСтрокиТекст = Новый Массив;
	
	Для Каждого ЭлСтрока Из масСтроки Цикл
		масСтрокиТекст.Добавить(СтрШаблон("<p>%1</p>", ЭлСтрока));	
	КонецЦикла;
	
	пСтрСообщение = СтрСоединить(масСтрокиТекст, "");
КонецПроцедуры

Функция СформироватьСписокДанныхHtmlПоСтроке(пИсходнаяСтрока)
	масСтроки1 = СтрРазделить(пИсходнаяСтрока, Символы.ПС);
	
	масСтрокиТекст1 = Новый Массив;
	
	Для Каждого ЭлСтрока Из масСтроки1 Цикл
		масСтрокиТекст1.Добавить(СтрШаблон("%1<br>", ЭлСтрока));	
	КонецЦикла;
	
	Возврат СтрСоединить(масСтрокиТекст1, "");
КонецФункции

Функция СформироватьСсылкуHtmlПоСтроке(пValueParam)	
	Возврат СтрШаблон("<a href=""%1"">Ссылка на аукцион</a>", пValueParam);
КонецФункции

Процедура ЗаменитьПараметрыВШаблонеНаЗначения(пСтрШаблон, пМасЗначенияПараметров)
	Для Каждого ЭлЗначениеПарам Из пМасЗначенияПараметров Цикл
		Если ЭлЗначениеПарам.NameParam = "АУКЦИОН_СТРУКТУРА_СТАВКИ" Тогда
			
			стрОбязательныеПоля = СформироватьСписокДанныхHtmlПоСтроке(ЭлЗначениеПарам.ValueParam.АУКЦИОН_СТРУКТУРА_СТАВКИ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ);
			
			стрНеобязательныеПоля = СформироватьСписокДанныхHtmlПоСтроке(ЭлЗначениеПарам.ValueParam.АУКЦИОН_СТРУКТУРА_СТАВКИ_НЕ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ);
			
			ИтоговыйФрагмент = стрОбязательныеПоля + "</p><p>" + стрНеобязательныеПоля;
			
			пСтрШаблон = СтрЗаменить(пСтрШаблон, "[" + ЭлЗначениеПарам.NameParam + "]", ИтоговыйФрагмент);
			
		ИначеЕсли ЭлЗначениеПарам.NameParam = "СТАВКА_ДАННЫЕ_СТАВКИ"
				  Или ЭлЗначениеПарам.NameParam = "СТАВКА_ДАННЫЕ_ПОБЕДНОЙ_СТАВКИ"
				  Или ЭлЗначениеПарам.NameParam = "АУКЦИОН_ЭТАПЫ"
				  Или ЭлЗначениеПарам.NameParam = "АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_УЧАСТНИКА"
				  Или ЭлЗначениеПарам.NameParam = "АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_ВСЕХ_УЧАСТНИКОВ"
		Тогда
		
		    НормализоватьСтрокуДляHTML(ЭлЗначениеПарам.ValueParam);
		
			пСтрШаблон = СтрЗаменить(пСтрШаблон, "[" + ЭлЗначениеПарам.NameParam + "]", СформироватьСписокДанныхHtmlПоСтроке(ЭлЗначениеПарам.ValueParam));
			
		ИначеЕсли ЭлЗначениеПарам.NameParam = "АУКЦИОН_ССЫЛКА" Тогда	
			пСтрШаблон = СтрЗаменить(пСтрШаблон, "[" + ЭлЗначениеПарам.NameParam + "]", СформироватьСсылкуHtmlПоСтроке(ЭлЗначениеПарам.ValueParam));	
		Иначе		
			пСтрШаблон = СтрЗаменить(пСтрШаблон, "[" + ЭлЗначениеПарам.NameParam + "]", ЭлЗначениеПарам.ValueParam);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура НормализоватьСтрокуДляHTML(пСтрИсходная) 
	Если СтрНайтиПоРегулярномуВыражению(пСтрИсходная, "\<|\>").Длина <> 0 Тогда
		пСтрИсходная = СтрЗаменитьПоРегулярномуВыражению(пСтрИсходная, "\<", "&lt;");
		пСтрИсходная = СтрЗаменитьПоРегулярномуВыражению(пСтрИсходная, "\>", "&gt;");
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
